//
//  MarketDataModel.swift
//  Crypto
//
//  Created by Павел Бескоровайный on 13.08.2023.
//

import Foundation
//JSON data:
/*
 URL:
 https://api.coingecko.com/api/v3/global
 
 JSON RESPONSE:
 {
 "data": {
 "active_cryptocurrencies": 10035,
 "upcoming_icos": 0,
 "ongoing_icos": 49,
 "ended_icos": 3376,
 "markets": 811,
 "total_market_cap": {
 "btc": 41510181.91675645,
 "eth": 659431917.6136628,
 "ltc": 14696893388.646967,
 "bch": 5325393403.525636,
 "bnb": 5071402820.50483,
 "eos": 1685582252757.9927,
 "xrp": 1939531605208.8977,
 "xlm": 8757162051227.251,
 "link": 164157276416.83456,
 "dot": 242797624636.47757,
 "yfi": 193722661.50334218,
 "usd": 1218226596951.919,
 "aed": 4474546290604.417,
 "ars": 349548090367347.75,
 "aud": 1873937062761.2942,
 "bdt": 133694380213522.81,
 "bhd": 460425087638.18756,
 "bmd": 1218226596951.919,
 "brl": 5978704070353.488,
 "cad": 1637235634973.5327,
 "chf": 1068227574295.8298,
 "clp": 1033945447448738.4,
 "cny": 8815818591502.266,
 "czk": 26772600453233.3,
 "dkk": 8291859332153.248,
 "eur": 1111104277602.1475,
 "gbp": 959687239187.2021,
 "hkd": 9523669155661.176,
 "huf": 426037702358443.2,
 "idr": 18667556169722584,
 "ils": 4553030539113.039,
 "inr": 101060972005309.03,
 "jpy": 176527125031318.16,
 "krw": 1620972309904226.2,
 "kwd": 375651135209.4973,
 "lkr": 392105960626940.06,
 "mmk": 2565002341701394.5,
 "mxn": 20725567271283.324,
 "myr": 5588005400218.441,
 "ngn": 939625383694018,
 "nok": 12703179662375.857,
 "nzd": 2035466600157.5344,
 "php": 68881568830567.6,
 "pkr": 352265661530764.2,
 "pln": 4934629056568.835,
 "rub": 121816575871567.11,
 "sar": 4570742335606.122,
 "sek": 13167811286453.299,
 "sgd": 1647156872379.111,
 "thb": 42917087518008.7,
 "try": 32987260396697.207,
 "twd": 38871784587066.945,
 "uah": 45109880773803.26,
 "vef": 121981029152.79568,
 "vnd": 28943380185087136,
 "zar": 23088463943263.24,
 "xdr": 913628528009.6428,
 "xag": 53698319807.43755,
 "xau": 636535579.1733484,
 "bits": 41510181916756.45,
 "sats": 4151018191675645
 },
 "total_volume": {
 "btc": 647574.2323242405,
 "eth": 10287382.47100742,
 "ltc": 229276987.33747047,
 "bch": 83078112.06485206,
 "bnb": 79115764.77504437,
 "eos": 26295708256.3037,
 "xrp": 30257412333.93022,
 "xlm": 136614975671.14435,
 "link": 2560914391.2992096,
 "dot": 3787732988.00329,
 "yfi": 3022145.363236654,
 "usd": 19004786702.697105,
 "aed": 69804581559.00677,
 "ars": 5453079842771.424,
 "aud": 29234113145.423897,
 "bdt": 2085681913089.582,
 "bhd": 7182802119.924273,
 "bmd": 19004786702.697105,
 "brl": 93270000753.48015,
 "cad": 25541483089.089794,
 "chf": 16664746320.780771,
 "clp": 16129932428132.281,
 "cny": 137530039452.73804,
 "czk": 417662495929.1645,
 "dkk": 129356080691.90804,
 "eur": 17333638793.568867,
 "gbp": 14971476839.930527,
 "hkd": 148572770766.34012,
 "huf": 6646346156690.364,
 "idr": 291220799278114.4,
 "ils": 71028964942.32794,
 "inr": 1576588642649.661,
 "jpy": 2753888617154.3296,
 "krw": 25287769186608.816,
 "kwd": 5860297022.856985,
 "lkr": 6116998401788.511,
 "mmk": 40014987784639.19,
 "mxn": 323326535694.3159,
 "myr": 87174956605.27145,
 "ngn": 14658504454118.02,
 "nok": 198174313821.04477,
 "nzd": 31754033833.48128,
 "php": 1074578019103.7427,
 "pkr": 5495474960756.332,
 "pln": 76982043333.86717,
 "rub": 1900383760364.9233,
 "sar": 71305275536.19844,
 "sek": 205422739469.45312,
 "sgd": 25696258071.99659,
 "thb": 669522481467.3219,
 "try": 514613495809.51654,
 "twd": 606414255507.798,
 "uah": 703730869474.7404,
 "vef": 1902949292.5410619,
 "vnd": 451527464799195.2,
 "zar": 360188600078.6018,
 "xdr": 14252943864.274937,
 "xag": 837713703.498992,
 "xau": 9930191.100026283,
 "bits": 647574232324.2405,
 "sats": 64757423232424.05
 },
 "market_cap_percentage": {
 "btc": 46.87059198877216,
 "eth": 18.216093295577,
 "usdt": 6.842752912624106,
 "bnb": 3.0330581051902157,
 "xrp": 2.7208276633896364,
 "usdc": 2.1473205439682412,
 "steth": 1.225183990293372,
 "doge": 0.8747675366133644,
 "ada": 0.8368009488749764,
 "sol": 0.8177633660611968
 },
 "market_cap_change_percentage_24h_usd": -0.1366764578734445,
 "updated_at": 1691941151
 }
 }
 
 */

struct GlobalData: Codable {
  let data: MarketDataModel?
}

struct MarketDataModel: Codable {
  let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
  let marketCapChangePercentage24HUsd: Double
  
  enum CodingKeys: String, CodingKey {
    case totalMarketCap = "total_market_cap"
    case totalVolume = "total_volume"
    case marketCapPercentage = "market_cap_percentage"
    case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
  }
  
  var marketCap: String {
    if let item = totalMarketCap.first(where: {$0.key == "usd" }) {
      return "$" + item.value.formattedWithAbbreviations()
    }
    return ""
  }
  
  var volume: String {
    if let item = totalVolume.first(where: { $0.key == "usd" }) {
      return "$" + item.value.formattedWithAbbreviations()
    }
    return ""
  }
  
  var btcDominance: String {
    if let item = marketCapPercentage.first(where: { $0.key == "btc" }) {
      return item.value.asPercentString()
    }
    return ""
  }
}
